7767517
96 106
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 432 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_3                   1 1 432 259 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_4                   1 1 259 435 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_7                   1 1 435 264 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_8                   1 1 264 438 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_9                   1 1 438 441 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_12                  1 1 441 271 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_13                  1 1 271 444 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_16                  1 1 444 276 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_17                  1 1 276 447 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 447 447_splitncnn_0 447_splitncnn_1
Convolution      Conv_18                  1 1 447_splitncnn_1 450 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_21                  1 1 450 283 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_22                  1 1 283 453 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_25                  1 1 453 288 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_26                  1 1 288 456 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_27                   2 1 447_splitncnn_0 456 291 0=0
Split            splitncnn_1              1 2 291 291_splitncnn_0 291_splitncnn_1
Convolution      Conv_28                  1 1 291_splitncnn_1 459 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_31                  1 1 459 296 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_32                  1 1 296 462 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_35                  1 1 462 301 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_36                  1 1 301 465 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_2              1 2 465 465_splitncnn_0 465_splitncnn_1
Convolution      Conv_37                  1 1 465_splitncnn_1 468 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_40                  1 1 468 308 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_41                  1 1 308 471 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_44                  1 1 471 313 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_45                  1 1 313 474 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_46                   2 1 465_splitncnn_0 474 316 0=0
Split            splitncnn_3              1 2 316 316_splitncnn_0 316_splitncnn_1
Convolution      Conv_47                  1 1 316_splitncnn_1 477 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_50                  1 1 477 321 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_51                  1 1 321 480 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_54                  1 1 480 326 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_55                  1 1 326 483 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_56                   2 1 316_splitncnn_0 483 329 0=0
Split            splitncnn_4              1 2 329 329_splitncnn_0 329_splitncnn_1
Convolution      Conv_57                  1 1 329_splitncnn_1 486 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_60                  1 1 486 334 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_61                  1 1 334 489 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_64                  1 1 489 339 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 339 492 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_5              1 2 492 492_splitncnn_0 492_splitncnn_1
Convolution      Conv_66                  1 1 492_splitncnn_1 495 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_69                  1 1 495 346 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_70                  1 1 346 498 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_73                  1 1 498 351 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_74                  1 1 351 501 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_75                   2 1 492_splitncnn_0 501 354 0=0
Split            splitncnn_6              1 2 354 354_splitncnn_0 354_splitncnn_1
Convolution      Conv_76                  1 1 354_splitncnn_1 504 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_79                  1 1 504 359 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 359 507 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_83                  1 1 507 364 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_84                  1 1 364 510 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_85                   2 1 354_splitncnn_0 510 367 0=0
Split            splitncnn_7              1 2 367 367_splitncnn_0 367_splitncnn_1
Convolution      Conv_86                  1 1 367_splitncnn_1 513 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_89                  1 1 513 372 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_90                  1 1 372 516 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_93                  1 1 516 377 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_94                  1 1 377 519 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_95                   2 1 367_splitncnn_0 519 380 0=0
Convolution      Conv_96                  1 1 380 522 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_97                  1 1 522 383
Convolution      Conv_98                  1 1 329_splitncnn_0 525 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             Relu_99                  1 1 525 386
Interp           Resize_101               1 1 383 391 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
Concat           Concat_102               2 1 386 391 392 0=0
Split            splitncnn_8              1 2 392 392_splitncnn_0 392_splitncnn_1
Convolution      Conv_103                 1 1 392_splitncnn_1 528 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_104                 1 1 528 395
BinaryOp         Add_105                  2 1 395 392_splitncnn_0 396 0=0
Convolution      Conv_106                 1 1 396 531 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_107                 1 1 531 399
Convolution      Conv_108                 1 1 399 534 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             Relu_109                 1 1 534 402
Convolution      Conv_110                 1 1 291_splitncnn_0 537 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
ReLU             Relu_111                 1 1 537 405
Interp           Resize_113               1 1 402 410 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
Concat           Concat_114               2 1 405 410 411 0=0
Split            splitncnn_9              1 2 411 411_splitncnn_0 411_splitncnn_1
Convolution      Conv_115                 1 1 411_splitncnn_1 540 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_116                 1 1 540 414
BinaryOp         Add_117                  2 1 414 411_splitncnn_0 415 0=0
Convolution      Conv_118                 1 1 415 543 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_119                 1 1 543 418
Convolution      Conv_120                 1 1 418 546 0=64 1=3 11=3 2=5 12=5 3=1 13=1 4=5 14=5 15=5 16=5 5=1 6=36864
ReLU             Relu_121                 1 1 546 421
Convolution      Conv_122                 1 1 421 549 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_123                 1 1 549 424
Convolution      Conv_124                 1 1 424 425 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Deconvolution    ConvTranspose_125        1 1 425 426 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 18=1 19=1 5=1 6=2304
Crop             Slice_130                1 1 426 output -23309=1,7 -23310=1,12 -23311=1,0
